In [ ]:
import pandas as pd

df = pd.read_json(
    "C:\\Users\\Lenovo\\Desktop\\Тест\\Занятие по pandas\\1 занятие\\pandas\\data\\auto_remix.json"
)

In [7]:
df.set_index('CarNumber',inplace = True)

In [11]:
df = df[df['Fines'] > 2100]

In [14]:
df = df[df['Refund'] == 2]

In [15]:
df

              Refund         Fines        Make   Model
CarNumber
704787163RUS       2   2800.000000        Ford   Focus
704987163RUS       2   8594.586466        Ford   Focus
7064C8197RUS       2  12800.000000  Volkswagen  Passat
7065C8197RUS       2  11400.000000  Volkswagen  Passat
7066C8197RUS       2   3000.000000  Volkswagen  Passat
...              ...           ...         ...     ...
Y965EE197RUS       2   9600.000000        Ford   Focus
Y966O8197RUS       2  10400.000000        Ford   Focus
Y966O8197RUS       2  20800.000000        Ford   Focus
Y969O8197RUS       2   7800.000000        Ford   Focus
Y973O8197RUS       2   8594.586466        Ford   Focus

[310 rows x 4 columns]

In [23]:
df = df[df['Model'].isin(['Corolla','Focus'])]

In [26]:
df = df.loc[df.index.isin(
    ['Y7689C197RUS', '92928M178RUS', '7788KT197RUS', 'H115YO163RUS', 'X758HY197RUS']
)]

In [27]:
df

              Refund          Fines  Make  Model
CarNumber
7788KT197RUS       2    4000.000000  Ford  Focus
7788KT197RUS       2   12000.000000  Ford  Focus
7788KT197RUS       2    8594.586466  Ford  Focus
92928M178RUS       2    3000.000000  Ford  Focus
X758HY197RUS       2   24200.000000  Ford  Focus
X758HY197RUS       2   72600.000000  Ford  Focus
X758HY197RUS       2  145200.000000  Ford  Focus
Y7689C197RUS       2    9000.000000  Ford  Focus
Y7689C197RUS       2   45000.000000  Ford  Focus

In [31]:
df.groupby(['Make'])['Fines'].median()

Make
Ford    12000.0
Name: Fines, dtype: float64

In [32]:
df.groupby(['Make','Model'])['Fines'].median()

Make  Model
Ford  Focus    12000.0
Name: Fines, dtype: float64

In [36]:
df.groupby(['Make','Model'])['Fines'].agg(['min','max'])

               min       max
Make Model
Ford Focus  3000.0  145200.0

In [ ]:
df.groupby(['Make','Model'])['Fines'].std()

Make  Model
Ford  Focus    46975.363794
Name: Fines, dtype: float64

In [42]:
df.groupby(['CarNumber'])['Fines'].count().sort_values(ascending = False)

CarNumber
7788KT197RUS    3
X758HY197RUS    3
Y7689C197RUS    2
92928M178RUS    1
Name: Fines, dtype: int64

In [ ]:
'''Перезапускаем первую ячейку,чтобы получить исходный датафрейм для выполнения задания
select from the initial dataframe all the rows corresponding to the top-1 car
  number, we want to zoom in a little bit
'''
top_car = df.groupby(['CarNumber'])['Fines'].sum().sort_values(ascending = False).head(1).index
df[df['CarNumber'] == top_car.values[0]]

        CarNumber  Refund     Fines  Make  Model
604  X758HY197RUS       2   24200.0  Ford  Focus
605  X758HY197RUS       2   72600.0  Ford  Focus
606  X758HY197RUS       2  145200.0  Ford  Focus

In [74]:
df.groupby(['CarNumber'])['Fines'].sum().sort_values(ascending = False)

CarNumber
X758HY197RUS    242000.0
9020YC197RUS    217500.0
M0279X197RUS    216000.0
Y352O8197RUS    207200.0
Y778EE197RUS    192000.0
                  ...
Y166O8161RUS       100.0
K326T8197RUS       100.0
Y195O8161RUS       100.0
C58078163RUS       100.0
705787163RUS       100.0
Name: Fines, Length: 531, dtype: float64

In [125]:
df.drop_duplicates(['CarNumber','Model'],inplace=True)

In [136]:
df.groupby(['Make'])['CarNumber'].agg(Count_CarNumber = 'count')

            Count_CarNumber
Make
Audi                      1
BMW                       3
Ford                    581
Skoda                    48
Toyota                   34
Volkswagen               56
Volvo                     2